Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/Microchip.PIC32MZ-EF_DFP.pdsc
         <device Dname="PIC32MZ1024EFM100">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ1024EFM100.atdf"/>
                  <at:variant ordercode="" vccmin="2.1" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x100000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x40" start="0x1fc0ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x40" start="0x1fc2ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x40" start="0x1fc2ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x40" start="0x1fc4ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x40" start="0x1fc4ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x40" start="0x1fc6ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x40" start="0x1fc6ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0x80000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1800" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0xe200" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc200" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0x7000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ1024EFM100.PIC"/>
                  <mchp:xc32 name="xc32"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ1024EFM100" title="Device page for PIC32MZ1024EFM100"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ1024EFM100" title="Datasheet"/>
         </device>
         <device Dname="PIC32MZ1024EFM124">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ1024EFM124.atdf"/>
                  <at:variant ordercode="" vccmin="2.1" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x100000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x40" start="0x1fc0ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x40" start="0x1fc2ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x40" start="0x1fc2ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x40" start="0x1fc4ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x40" start="0x1fc4ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x40" start="0x1fc6ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x40" start="0x1fc6ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0x80000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1800" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0xe200" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc200" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0x7000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ1024EFM124.PIC"/>
                  <mchp:xc32 name="xc32"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ1024EFM124" title="Device page for PIC32MZ1024EFM124"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ1024EFM124" title="Datasheet"/>
         </device>
         <device Dname="PIC32MZ1024EFF124">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ1024EFF124.atdf"/>
                  <at:variant ordercode="" vccmin="2.1" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x100000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x40" start="0x1fc0ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x40" start="0x1fc2ff40" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x40" start="0x1fc2ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x40" start="0x1fc4ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x40" start="0x1fc4ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x40" start="0x1fc6ff40" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x40" start="0x1fc6ffc0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0x40000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1800" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0xe200" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc200" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0x7000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ1024EFF124.PIC"/>
                  <mchp:xc32 name="xc32"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ1024EFF124" title="Device page for PIC32MZ1024EFF124"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ1024EFF124" title="Datasheet"/>
         </device>
